In [2]:
import pandas as pd
import numpy as np

In [ ]:
def get_even_lists(lst):
    even_pos = []
    odd_pos = []
    lim = len(lst)

    for i in range(len(lst)):
        if i % 2 == 1:
            odd_pos.append(lst[i])
        else:
            even_pos.append(lst[i])
    
    return odd_pos, even_pos

In [28]:
df = pd.read_csv("S1.csv", delimiter=";")
df["TIMESTAMP"] = pd.to_datetime(df["TIMESTAMP"], format="%d/%m/%Y %H:%M")

In [29]:
for i in ["TRIP", "TEMPERATURE", "FUEL", "PERSONS","COUNT_TRIPS"]:
    df[i].fillna(method="ffill", inplace=True)

C:\Users\canut\AppData\Local\Temp\ipykernel_12756\2253822055.py:2: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df[i].fillna(method="ffill", inplace=True)

In [36]:
df["ALTITUDE"].fillna(df["ALTITUDE"].rolling(window=4, min_periods=1).mean(), inplace=True)

df["ALTITUDE"] = df["ALTITUDE"].round(0)

In [37]:
dn = list(df.select_dtypes(include=np.number).columns)

for i in dn:
    df[i] = df[i].astype(int)

In [19]:
df[df["ALTITUDE"].isna()].index

Index([], dtype='int64')

In [31]:
for i in [366, 367]:
    df.at[i, "ALTITUDE"] = 106

In [33]:
df.at[387, "ALTITUDE"] = 98

In [38]:
df

,TIMESTAMP,SPEED,ALTITUDE,TRIP,TEMPERATURE,FUEL,PERSONS,COUNT_TRIPS
0,2024-05-03 16:45:00,0,7,RETURN,21,SHELL,1,1
1,NaT,0,7,RETURN,21,SHELL,1,1
2,NaT,10,7,RETURN,21,SHELL,1,1
3,NaT,5,7,RETURN,21,SHELL,1,1
4,NaT,23,7,RETURN,21,SHELL,1,1
...,...,...,...,...,...,...,...,...
1241,NaT,36,5,GO,23,SHELL,2,2
1242,NaT,28,5,GO,23,SHELL,2,2
1243,NaT,14,5,GO,23,SHELL,2,2
1244,NaT,6,5,GO,23,SHELL,2,2
1245,2024-05-16 20:13:00,0,5,GO,23,SHELL,2,2

In [76]:
df.to_csv("final_V2.csv", mode='a', header=False)

In [87]:
df = pd.read_csv("fin_V2.csv", delimiter=";")
df["TIMESTAMP"] = pd.to_datetime(df["TIMESTAMP"], format="%d/%m/%Y %H:%M")

In [85]:
# df["TIMESTAMP"] = pd.to_datetime(df["TIMESTAMP"], format="%Y-%m-%d %H:%M:%S")

df_2["TIMESTAMP"] = pd.to_datetime(df_2["TIMESTAMP"], format="%d/%m/%Y %H:%M")

In [41]:
lr = df[df["TIMESTAMP"].notnull()].index
lr

Index([   0,  113,  114,  270,  271,  429,  430,  558,  559,  687,  688,  812,
        813,  932,  933, 1088, 1089, 1245],
      dtype='int64')

In [42]:
odd_l, even_l = get_even_lists(lr)
odd_l, even_l

([113, 270, 429, 558, 687, 812, 932, 1088, 1245],
 [0, 114, 271, 430, 559, 688, 813, 933, 1089])

In [43]:
lg = []
for i, j in zip(even_l, odd_l):
    l_i = pd.date_range(
        start=pd.to_datetime(str(df["TIMESTAMP"][i])),
        end=pd.to_datetime(str(df["TIMESTAMP"][j])),
        periods=(j - i + 1),
    ).round(freq="min")
    print(l_i[-1])
    lg.append(l_i)

ld = [x for xs in lg for x in xs]
df["TIMESTAMP"] = ld

2024-05-03 17:03:00
2024-05-04 12:20:00
2024-05-04 14:39:00
2024-05-10 08:16:00
2024-05-10 13:56:00
2024-05-15 08:18:00
2024-05-15 17:58:00
2024-05-16 19:18:00
2024-05-16 20:13:00

In [154]:
df.drop("Unnamed: 0", axis=1, inplace=True)

In [96]:
df

,TIMESTAMP,SPEED,ALTITUDE,TRIP,TEMPERATURE,FUEL,PERSONS,COUNT_TRIPS,day_formatted,day_fuel,ROUTE
0,2024-04-21 16:50:00,0,33,GO,22,REPSOL,1,1,21/04/2024,21/04/2024_REPSOL_1,CITY
1,2024-04-21 16:50:00,4,33,GO,22,REPSOL,1,1,21/04/2024,21/04/2024_REPSOL_1,CITY
2,2024-04-21 16:50:00,9,33,GO,22,REPSOL,1,1,21/04/2024,21/04/2024_REPSOL_1,CITY
3,2024-04-21 16:50:00,0,33,GO,22,REPSOL,1,1,21/04/2024,21/04/2024_REPSOL_1,CITY
4,2024-04-21 16:50:00,13,33,GO,22,REPSOL,1,1,21/04/2024,21/04/2024_REPSOL_1,CITY
...,...,...,...,...,...,...,...,...,...,...,...
2101,2024-05-16 20:12:00,36,5,GO,23,SHELL,2,2,16/05/2024,16/05/2024_SHELL_2,CITY
2102,2024-05-16 20:12:00,28,5,GO,23,SHELL,2,2,16/05/2024,16/05/2024_SHELL_2,CITY
2103,2024-05-16 20:12:00,14,5,GO,23,SHELL,2,2,16/05/2024,16/05/2024_SHELL_2,CITY
2104,2024-05-16 20:13:00,6,5,GO,23,SHELL,2,2,16/05/2024,16/05/2024_SHELL_2,CITY
2105,2024-05-16 20:13:00,0,5,GO,23,SHELL,2,2,16/05/2024,16/05/2024_SHELL_2,CITY

In [94]:
df = pd.read_csv("fin_V2.csv", delimiter=";")
df["TIMESTAMP"] = pd.to_datetime(df["TIMESTAMP"], format="%d/%m/%Y %H:%M")

In [95]:
df['day_formatted'] = df['TIMESTAMP'].dt.strftime("%d/%m/%Y")

df['day_fuel'] = df['day_formatted'] + "_" + df['FUEL'].astype(str)
df['day_fuel'] = df['day_fuel'] + "_" + df['COUNT_TRIPS'].astype(str)

df['ROUTE'] = df['SPEED'].apply(lambda speed: 'CITY' if speed <= 47 else 'HIGHSPEED')

In [86]:
dfb_bp = df.copy()

In [101]:
df_f = pd.concat([dfb_bp, df], axis=0)
df_f.to_csv("final_4.csv")

In [102]:
df_f

,TIMESTAMP,SPEED,ALTITUDE,TRIP,TEMPERATURE,FUEL,PERSONS,COUNT_TRIPS,day_formatted,day_fuel,ROUTE
0,2024-04-05 18:01:00,5,30,GO,21,BP,3,1,05/04/2024,05/04/2024_BP_1,CITY
1,2024-04-05 18:01:00,21,30,GO,21,BP,3,1,05/04/2024,05/04/2024_BP_1,CITY
2,2024-04-05 18:02:00,7,30,GO,21,BP,3,1,05/04/2024,05/04/2024_BP_1,CITY
3,2024-04-05 18:02:00,7,30,GO,21,BP,3,1,05/04/2024,05/04/2024_BP_1,CITY
4,2024-04-05 18:03:00,8,30,GO,21,BP,3,1,05/04/2024,05/04/2024_BP_1,CITY
...,...,...,...,...,...,...,...,...,...,...,...
2101,2024-05-16 20:12:00,36,5,GO,23,SHELL,2,2,16/05/2024,16/05/2024_SHELL_2,CITY
2102,2024-05-16 20:12:00,28,5,GO,23,SHELL,2,2,16/05/2024,16/05/2024_SHELL_2,CITY
2103,2024-05-16 20:12:00,14,5,GO,23,SHELL,2,2,16/05/2024,16/05/2024_SHELL_2,CITY
2104,2024-05-16 20:13:00,6,5,GO,23,SHELL,2,2,16/05/2024,16/05/2024_SHELL_2,CITY
2105,2024-05-16 20:13:00,0,5,GO,23,SHELL,2,2,16/05/2024,16/05/2024_SHELL_2,CITY

In [91]:
l_g = list(df_f['FUEL'].unique())
l_g

AttributeError: 'DataFrame' object has no attribute 'unique'

In [134]:
agg_c = {'SPEED': ['mean', 'median', 'max'], 
         'ALTITUDE': ['mean', 'median','max'],
         'PERSONS': ['max'], 
         'TEMPERATURE': 'mean'}

In [135]:
for i in l_g:
    print(df[df['FUEL'] == i].groupby('day_d').agg(agg_c).round(0))

                SPEED             ALTITUDE             PERSONS TEMPERATURE
                 mean median  max     mean median  max     max        mean
day_d
05/04/2024_1_BP  18.0   18.0   43     39.0   39.0   50       3        21.0
05/04/2024_2_BP  14.0   14.0   38     39.0   38.0   50       3        21.0
06/04/2024_1_BP  51.0   44.0  112     46.0   32.0  125       3        22.0
06/04/2024_2_BP  65.0   70.0  126     46.0   27.0  125       1        26.0
13/04/2024_1_BP  52.0   39.0  115     59.0   43.0  125       2        19.0
                    SPEED             ALTITUDE             PERSONS TEMPERATURE
                     mean median  max     mean median  max     max        mean
day_d
14/04/2024_1_REPSOL  22.0   19.0   67    104.0  105.0  113       4        22.0
14/04/2024_2_REPSOL  41.0   26.0  123     69.0   87.0  125       4        23.0
19/04/2024_1_REPSOL  15.0   14.0   48     30.0   30.0   33       1        23.0
19/04/2024_2_REPSOL  20.0   21.0   77     30.0   30.0   33       1        23.0
20/04/2024_1_REPSOL  55.0   52.0  130     34.0   26.0  125       2        20.0
21/04/2024_1_REPSOL  30.0   32.0   62     59.0   62.0  117       4        22.0
21/04/2024_2_REPSOL  57.0   66.0  107     81.0   81.0  180       4        24.0
21/04/2024_3_REPSOL  24.0   26.0   39     19.0   20.0   34       1        22.0
                SPEED             ALTITUDE             PERSONS TEMPERATURE
                 mean median  max     mean median  max     max        mean
day_d
03/05/2024_1_V2  14.0   14.0   29     29.0   30.0   33       2        17.0
03/05/2024_2_V2  14.0   14.0   29     29.0   30.0   33       1        17.0
03/05/2024_3_V2  19.0   20.0   43     22.0   24.0   34       1        22.0
21/04/2024_1_V2  26.0   26.0   78     18.0   18.0   34       1        22.0
23/04/2024_1_V2  56.0   49.0  128     33.0   25.0  125       1        18.0
25/04/2024_1_V2  32.0   24.0   97     44.0   33.0   93       1        20.0
25/04/2024_2_V2  38.0   30.0   87     47.0   33.0   89       1        21.0
26/04/2024_1_V2  31.0   25.0   97     14.0    8.0   33       1        18.0
26/04/2024_2_V2  37.0   32.0   94     11.0    8.0   33       1        22.0

In [115]:
def route(fuel):
    results = {
    'total': df[df['FUEL'] == fuel].groupby('day_fuel')['ROUTE'].count(),
    'city_tot': df[(df['FUEL'] == fuel) & (df['ROUTE'] == 'CITY')].groupby('day_fuel')['ROUTE'].count(),
    'high_tot': df[(df['FUEL'] == fuel) & (df['ROUTE'] == 'HIGHSPEED')].groupby('day_fuel')['ROUTE'].count()    
    }

    results_df = pd.DataFrame(results).fillna(0)
    results_df.reset_index(inplace=True)

    results_df['city_%'] = round(results_df['city_tot']/results_df['total']*100,2)
    
    return results_df

In [116]:
route('BP')

          day_fuel  total  city_tot  high_tot  city_%
0  05/04/2024_BP_1     43        43       0.0  100.00
1  05/04/2024_BP_2     59        59       0.0  100.00
2  06/04/2024_BP_1     46        24      22.0   52.17
3  06/04/2024_BP_2     55        20      35.0   36.36
4  13/04/2024_BP_1     83        45      38.0   54.22